Please review and approve this deployment.
**Branch/Commit:** refs/heads/main / fd3659d1bbc5114186c575135c70543501a3b9e0
**Workflow run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/18041383235

**Plan (last ~500 lines):**
```
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Reading...
module.karpenter.data.aws_caller_identity.current: Reading...
module.karpenter_disabled.data.aws_caller_identity.current: Reading...
module.karpenter.data.aws_partition.current: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b3d8d7905938d78c]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=819195744]
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
data.aws_availability_zones.available: Reading...
module.karpenter.data.aws_region.current: Reading...
module.eks_bottlerocket.data.aws_partition.current[0]: Reading...
module.karpenter.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.karpenter_disabled.data.aws_region.current: Reading...
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks_bottlerocket.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.karpenter_disabled.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.karpenter_disabled.data.aws_partition.current: Reading...
module.karpenter_disabled.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_bottlerocket.aws_iam_role.this[0]: Refreshing state... [id=cilium-cluster-20250926142835616600000002]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-20250926142835617400000004]
data.aws_caller_identity.current: Read complete after 0s [id=936668162005]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-node-group-20250926142835616100000001]
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Read complete after 0s [id=936668162005]
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=936668162005]
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Reading...
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks_bottlerocket.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::936668162005:policy/cilium-cluster-20250926142835616600000003]
module.karpenter.data.aws_caller_identity.current: Read complete after 0s [id=936668162005]
module.karpenter_disabled.data.aws_caller_identity.current: Read complete after 0s [id=936668162005]
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=936668162005]
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::936668162005:assumed-role/gh-actions-role/gha-tf-plan-18041383235]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-node-group-20250926142835616100000001-2025092614283644510000000a]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_instance_profile.this[0]: Refreshing state... [id=karpenter-node-group-20250926142836211600000005]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=karpenter-node-group-20250926142835616100000001-2025092614283645320000000b]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=karpenter-node-group-20250926142835616100000001-20250926142836354600000009]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=cilium-cluster-20250926142835616600000002-20250926142836313100000007]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=cilium-cluster-20250926142835616600000002-20250926142836323800000008]
module.eks_bottlerocket.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cilium-cluster-20250926142835616600000002-20250926142836312200000006]
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3680549247]
module.eks_bottlerocket.module.kms.aws_kms_key.this[0]: Refreshing state... [id=f25ac4e4-0f7d-44bb-a174-e7b9fafe93eb]
module.eks_bottlerocket.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/cilium]
module.eks_bottlerocket.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::936668162005:policy/cilium-cluster-ClusterEncryption20250926142857445000000012]
module.eks_bottlerocket.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=cilium-cluster-20250926142835616600000002-20250926142857914000000013]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-066bc6fa3abe9f2f3]
aws_vpc_ipv4_cidr_block_association.pods: Refreshing state... [id=vpc-cidr-assoc-063c95a980c73e2a4]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0a11ec7c771ecae16]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0acffaf73d4bcb8d7]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0c44ded9d706de294]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-014e11ad133afd35d]
module.vpc.aws_subnet.intra[2]: Refreshing state... [id=subnet-02f8a6b3ea6a1470f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-09d28dc3239e375c6]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-0799d0e13e71e8591]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07ecace1eb2e9ad2f]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-082da060ced22dfcb]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0dd380555f5f80227]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-0152dea544c334d43]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09af39b30da1a74ac]
module.eks_bottlerocket.aws_security_group.node[0]: Refreshing state... [id=sg-0fb1fba9e61e861d0]
module.eks_bottlerocket.aws_security_group.cluster[0]: Refreshing state... [id=sg-0abbf8f28026579ef]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-086d5a7eae9cc2182]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0088faacfd43293a0]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-091231ec83be6f9e1]
aws_subnet.pods["us-east-1c"]: Refreshing state... [id=subnet-045440a15ef452794]
aws_subnet.pods["us-east-1a"]: Refreshing state... [id=subnet-0965e1328af756a6c]
aws_subnet.pods["us-east-1b"]: Refreshing state... [id=subnet-0028d2501ec14bb28]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09d28dc3239e375c61080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a96b42db824ee524]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-0c07a23cfd7eaabd6]
module.vpc.aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0e3c014b131c9cf47]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0bf51225d3b28b882]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c2eea86689cb67c1]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-006777baa685daf8e]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-04e0cb836e3c20570]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d9e4c461071745a3]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0ad333c5569cb9180]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-055256a9e1bd6bddf]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2924228108]
module.eks_bottlerocket.aws_security_group_rule.node["allow_all_from_vpc"]: Refreshing state... [id=sgrule-188125975]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-925021949]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-4267161410]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-771240416]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1442082734]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-827677797]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-571039812]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2309460495]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3947562962]
module.eks_bottlerocket.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2515515529]
module.eks_bottlerocket.aws_security_group_rule.node["allow_icmp_from_vpc"]: Refreshing state... [id=sgrule-2777839756]
module.eks_bottlerocket.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3806004811]
aws_route_table_association.pods["us-east-1b"]: Refreshing state... [id=rtbassoc-0648337ff3ccecfda]
aws_route_table_association.pods["us-east-1c"]: Refreshing state... [id=rtbassoc-023f0314d74224e48]
aws_route_table_association.pods["us-east-1a"]: Refreshing state... [id=rtbassoc-051dfbd1ef9b8c3fb]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-093f0a9cd4783d571]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0acffaf73d4bcb8d71080289494]
module.eks_bottlerocket.aws_eks_cluster.this[0]: Refreshing state... [id=cilium]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["GithubRepo"]: Refreshing state... [id=sg-0bff9faeb655419d9,GithubRepo]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0bff9faeb655419d9,Environment]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["Cluster"]: Refreshing state... [id=sg-0bff9faeb655419d9,Cluster]
module.eks_bottlerocket.time_sleep.this[0]: Refreshing state... [id=2025-09-26T14:38:58Z]
module.eks_bottlerocket.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=cilium:arn:aws:iam::936668162005:role/gh-actions-role]
module.eks_bottlerocket.data.tls_certificate.this[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=2416616892243227483]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_eks_access_entry.this[0]: Refreshing state... [id=cilium:arn:aws:iam::936668162005:role/karpenter-node-group-20250926142835616100000001]
module.eks_bottlerocket.data.tls_certificate.this[0]: Read complete after 0s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
module.eks_bottlerocket.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::936668162005:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/4AAF8FC513C47C4670C75F96F5A584C1]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/bottlerocket/aws-k8s-1.33/x86_64/latest/image_id]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-0be209e882e4804eb]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_autoscaling_group.this[0]: Refreshing state... [id=karpenter-20250926143904492500000022]
module.eks_bottlerocket.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=cilium#arn:aws:iam::936668162005:role/gh-actions-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
aws_eks_addon.pod_identity_agent: Refreshing state... [id=cilium:eks-pod-identity-agent]
module.karpenter.aws_eks_pod_identity_association.karpenter[0]: Refreshing state... [id=a-pz1nrbkng5ku0qdmg]
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20250926143830202700000017]
module.network.data.aws_eks_cluster.this: Reading...
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20250926143830201200000016]
module.network.data.aws_eks_cluster_auth.this: Reading...
module.network.data.aws_caller_identity.current: Reading...
module.network.data.aws_eks_cluster_auth.this: Read complete after 0s [id=cilium]
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20250926143830203400000018]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20250926143830198300000015]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/936668162005/Karpenter-cilium]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=cilium]
module.network.data.aws_caller_identity.current: Read complete after 0s [id=936668162005]
module.network.helm_release.kube_prometheus_stack: Refreshing state... [id=kube-prometheus-stack]
data.kubectl_file_documents.letsencrypt: Reading...
data.kubectl_file_documents.letsencrypt: Read complete after 0s [id=0d35e50690b8b7d4ff7e70e6ee54f4b6ea4d2673b7ecdf32ac7a89e94cb5eb7b]
data.kubectl_file_documents.karpenter: Reading...
module.aws_auth.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
data.kubectl_file_documents.karpenter: Read complete after 0s [id=dd1b592a0d2070c1984b3238c4ce712a3de420b90d76f16569a8a624fd84e44a]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=2786600793]
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/936668162005/Karpenter-cilium]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=cilium-2025092614383103910000001d]
module.network.data.aws_eks_cluster.this: Read complete after 0s [id=cilium]
module.karpenter.data.aws_iam_policy_document.v1[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v033[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v033[0]: Read complete after 0s [id=3643659424]
module.karpenter.data.aws_iam_policy_document.v1[0]: Read complete after 0s [id=1470046619]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=cilium-2025092614383087950000001b]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=cilium-2025092614383073180000001a]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=cilium-2025092614383100250000001c]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=cilium:arn:aws:iam::936668162005:role/cilium]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.network.helm_release.cilium: Refreshing state... [id=cilium]
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=3643659424]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::936668162005:policy/KarpenterController-2025092614385652820000001e]
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20250926143830202700000017-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20250926143830198300000015-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20250926143830203400000018-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20250926143830201200000016-KarpenterInterruptionQueueTarget]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-20250926142835617400000004-2025092614385697660000001f]
module.aws_auth.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.network.helm_release.tetragon: Refreshing state... [id=tetragon]
aws_eks_addon.coredns: Refreshing state... [id=cilium:coredns]
module.helm.helm_release.external_dns: Refreshing state... [id=external-dns]
module.helm.data.aws_iam_policy_document.lb_controller_policy: Reading...
module.helm.helm_release.karpenter: Refreshing state... [id=karpenter]
module.helm.data.aws_subnets.public: Reading...
module.helm.data.aws_caller_identity.current: Reading...
module.helm.data.aws_iam_policy_document.external_dns_policy: Reading...
module.helm.data.aws_region.current: Reading...
module.helm.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.helm.data.aws_iam_policy_document.external_dns_policy: Read complete after 0s [id=2902363378]
module.helm.aws_iam_policy.external_dns_policy: Refreshing state... [id=arn:aws:iam::936668162005:policy/eks-external-dns-policy]
module.helm.data.aws_iam_policy_document.lb_controller_policy: Read complete after 0s [id=458242647]
module.helm.aws_iam_policy.load_balancer_controller_policy: Refreshing state... [id=arn:aws:iam::936668162005:policy/eks-load-balancer-controller-policy]
module.helm.data.aws_caller_identity.current: Read complete after 0s [id=936668162005]
module.helm.aws_iam_role.eks_ebs_csi_controller: Refreshing state... [id=ebs-csi-controller-role]
module.helm.aws_iam_role.eks_load_balancer_controller: Refreshing state... [id=eks-load-balancer-controller-role]
module.helm.aws_iam_role.eks_external_dns: Refreshing state... [id=eks-external-dns-role]
module.helm.data.aws_subnets.public: Read complete after 0s [id=us-east-1]
module.helm.aws_iam_role_policy_attachment.attach_ebs_csi_policy: Refreshing state... [id=ebs-csi-controller-role-20250926144237175100000025]
module.helm.kubernetes_service_account.eks_ebs_csi_controller: Refreshing state... [id=kube-system/ebs-csi-controller-sa]
module.helm.aws_iam_role_policy_attachment.attach_external_dns_policy: Refreshing state... [id=eks-external-dns-role-20250926144237179800000026]
module.helm.kubernetes_service_account.external_dns: Refreshing state... [id=kube-system/external-dns]
module.helm.aws_iam_role_policy_attachment.attach_load_balancer_policy: Refreshing state... [id=eks-load-balancer-controller-role-20250926144237098400000024]
module.helm.kubernetes_service_account.aws_load_balancer_controller: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.helm.helm_release.ebs_csi_driver: Refreshing state... [id=aws-ebs-csi-driver]
module.helm.helm_release.aws_load_balancer_controller: Refreshing state... [id=aws-load-balancer-controller]
module.helm.helm_release.ingress-nginx: Refreshing state... [id=ingress-nginx]
module.helm.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.helm.helm_release.argocd: Refreshing state... [id=argocd]
module.helm.helm_release.jaeger: Refreshing state... [id=jaeger]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.karpenter["/apis/karpenter.k8s.aws/v1/ec2nodeclasses/bottlerocket"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.k8s.aws/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "EC2NodeClass"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "bottlerocket"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.k8s.aws/v1
            kind: EC2NodeClass
            metadata:
              name: bottlerocket
            spec:
              amiSelectorTerms:
              - alias: bottlerocket@latest
              blockDeviceMappings:
              - deviceName: /dev/xvdb
                ebs:
                  deleteOnTermination: true
                  encrypted: true
                  iops: 3000
                  volumeSize: 20Gi
                  volumeType: gp3
              role: cilium
              securityGroupSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cilium
              subnetSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cilium
              tags:
                karpenter.sh/discovery: cilium
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter["/apis/karpenter.sh/v1/nodepools/bottlerocket"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NodePool"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "bottlerocket"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1
            kind: NodePool
            metadata:
              name: bottlerocket
            spec:
              disruption:
                consolidateAfter: 30s
                consolidationPolicy: WhenEmpty
              limits:
                cpu: 5000
              template:
                metadata:
                  labels:
                    workload: apps
                spec:
                  nodeClassRef:
                    group: karpenter.k8s.aws
                    kind: EC2NodeClass
                    name: bottlerocket
                  requirements:
                  - key: node.kubernetes.io/instance-type
                    operator: In
                    values:
                    - t3.medium
                  - key: karpenter.sh/capacity-type
                    operator: In
                    values:
                    - on-demand
                  startupTaints:
                  - effect: NoSchedule
                    key: node.cilium.io/agent-not-ready
                    value: "true"
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.letsencrypt["/apis/cert-manager.io/v1/namespaces/cert-manager/clusterissuers/letsencrypt-staging"] will be created
  + resource "kubectl_manifest" "letsencrypt" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "letsencrypt-staging"
      + namespace               = "cert-manager"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt-staging
              namespace: cert-manager
            spec:
              acme:
                email: johnmonteiro78@yahoo.com
                privateKeySecretRef:
                  name: letsencrypt-staging
                server: https://acme-staging-v02.api.letsencrypt.org/directory
                solvers:
                - http01:
                    ingress:
                      ingressClassName: nginx
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.helm.helm_release.otel_collector will be created
  + resource "helm_release" "otel_collector" {
      + atomic                     = true
      + chart                      = "opentelemetry-collector"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "otel-collector"
      + namespace                  = "giropops-senhas"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://open-telemetry.github.io/opentelemetry-helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + <<-EOT
                "config":
                  "exporters":
                    "jaeger":
                      "endpoint": "jaeger.giropops-senhas.svc.cluster.local:14250"
                      "tls":
                        "insecure": true
                    "logging":
                      "loglevel": "warn"
                    "prometheus":
                      "endpoint": "0.0.0.0:9464"
                  "processors":
                    "batch": {}
                  "receivers":
                    "otlp":
                      "protocols":
                        "grpc":
                          "endpoint": "0.0.0.0:4317"
                        "http":
                          "endpoint": "0.0.0.0:4318"
                  "service":
                    "pipelines":
                      "logs":
                        "exporters":
                        - "logging"
                        "processors":
                        - "batch"
                        "receivers":
                        - "otlp"
                      "metrics":
                        "exporters":
                        - "prometheus"
                        - "logging"
                        "processors":
                        - "batch"
                        "receivers":
                        - "otlp"
                      "traces":
                        "exporters":
                        - "jaeger"
                        - "logging"
                        "processors":
                        - "batch"
                        "receivers":
                        - "otlp"
                "image":
                  "repository": "otel/opentelemetry-collector-contrib"
                "mode": "deployment"
                "resources":
                  "limits":
                    "cpu": "500m"
                    "memory": "512Mi"
                  "requests":
                    "cpu": "100m"
                    "memory": "256Mi"
                "service":
                  "type": "ClusterIP"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.132.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
